** Selecting the Anti-Alias Filter
- *Antialiase Filter* This is an analog low pass filter designed to remove all frequencies above the nyquist frequency.
- *Reconstruction Filter* This is the output filter for a DAC and may include zeroth order hold filter and frequency boost.
- Filter complexity can be adjusted by number of *poles* and *zeros*.  More poles is more complicated electronics but better performance.
- Three types of analog filters are commonly used.  Each is designed to optimze a different design parameter.
  + *Chebyshev*
  + *Butterworth*
  + *Bessel or Thompson*

\newpage
#+BEGIN_SRC latex
\begin{figure}
\begin{center}
\begin{circuitikz} \draw
  (6,0) node[op amp, yscale=-1] (opamp) {}
  (8, -4.5) node[ground] (ground) {}
  
  (opamp.out) to (9, 0)
  
  (opamp.+) -- (4,0.5) to [ R=R ] (2,0.5)
  (0, 0.5) to [R=R] (2,0.5)
  (4.25, 0.5) to [C=C] (4.25, -1)
  (4.25, -1) to node[sground]{}  (4.25, -1.5)

  (2,  0.5) -- (2, 1.75)
  (2, 1.75) to [C=C] (6.25, 1.75)
  (6.25, 1.75) -- (8, 1.75)
  (8, 1.75) -- (8,0)

  (8,0) to [R=$R_f$] (8, -2)
  (8,-2) to [R=$R_1$] (8,-4)
  (8,-4) -- (ground)
  (8,-2) -- (4.8, -2)
  (4.8, -2) -- (opamp.-)
;
\end{circuitikz}
\vspace{0.25cm}
\caption{Modified Sallen-Key Circuit}
\label{fig:Sallen-Key Circuit}
\end{center}
\end{figure}
#+END_SRC


#+RESULTS:
#+BEGIN_EXPORT latex
\begin{figure}
\begin{center}
\begin{circuitikz} \draw
  (6,0) node[op amp, yscale=-1] (opamp) {}
  (8, -4.5) node[ground] (ground) {}
  
  (opamp.out) to (9, 0)
  
  (opamp.+) -- (4,0.5) to [ R=R ] (2,0.5)
  (0, 0.5) to [R=R] (2,0.5)
  (4.25, 0.5) to [C=C] (4.25, -1)
  (4.25, -1) to node[sground]{}  (4.25, -1.5)

  (2,  0.5) -- (2, 1.75)
  (2, 1.75) to [C=C] (6.25, 1.75)
  (6.25, 1.75) -- (8, 1.75)
  (8, 1.75) -- (8,0)

  (8,0) to [R=$R_f$] (8, -2)
  (8,-2) to [R=$R_1$] (8,-4)
  (8,-4) -- (ground)
  (8,-2) -- (4.8, -2)
  (4.8, -2) -- (opamp.-)
;
\end{circuitikz}
\vspace{0.25cm}
\caption{Modified Sallen-Key Circuit}
\label{fig:Sallen-Key Circuit}
\end{center}
\end{figure}
#+END_EXPORT


